Repository: Leonif/ios-if-app
Catalog: IFApp/*.lproj/Localizable.strings
Languages: uk

# timer.button.start
source: Start
uk: Старт

# timer.button.stop
source: Stop
uk: Стоп

# timer.button.reset
source: Reset
uk: Скинути

# phase.anabolic
source: Anabolic
uk: Анаболічна

# phase.catabolic
source: Catabolic
uk: Катаболічна

# phase.fatBurning
source: Fat Burning
uk: Жироспалювання

# phase.description.anabolic
source: 🍽️ Active digestion and nutrient absorption period 🩸 Elevated blood glucose and insulin levels ⚡ Body stores energy in muscles and liver as glycogen 🏋️ Excess carbohydrates are converted to fats 🔄 Active tissue recovery and growth processes 💪 Optimal time for mass training
uk: 🍽️ Період активного травлення та засвоєння поживних речовин 🩸 У крові підвищений рівень глюкози та інсуліну ⚡ Організм запасає енергію в м'язах та печінці у вигляді глікогену 🏋️ Надлишки вуглеводів перетворюються на жири 🔄 Активно йдуть процеси відновлення та росту тканин 💪 Це оптимальний час для тренувань на масу

# phase.description.catabolic
source: 📉 Glucose and insulin levels decrease 🔋 Body starts using glycogen reserves ⚖️ Breakdown processes activate 🧪 Glucagon production begins - a hormone that promotes glycogen breakdown 🔄 Body gradually transitions to using fat reserves 🏃 Good time for cardio training
uk: 📉 Рівень глюкози та інсуліну знижується 🔋 Організм починає використовувати запаси глікогену ⚖️ Активізуються процеси розщеплення 🧪 Починається вироблення глюкагону - гормону, що сприяє розщепленню глікогену 🔄 Організм поступово переходить на використання жирових запасів 🏃 У цій фазі добре проводити кардіо тренування

# phase.description.fatBurning
source: 📪 Glycogen stores are depleted 🔥 Body switches to using fat reserves as main energy source ⚗️ Ketone bodies are actively produced 📉 Insulin levels drop to minimum 🧹 Autophagy processes activate (cell cleansing) 📈 Growth hormone production increases ✨ Insulin sensitivity improves 🔥 Active fat burning occurs 💪 Optimal time for fat burning workouts
uk: 📪 Запаси глікогену виснажуються 🔥 Організм переключається на використання жирових запасів як основного джерела енергії ⚗️ Активно виробляються кетонові тіла 📉 Знижується рівень інсуліну до мінімуму 🧹 Активуються процеси аутофагії (очищення клітин) 📈 Збільшується вироблення гормону росту ✨ Покращується чутливість до інсуліну 🔥 Відбувається активне жироспалювання 💪 Це оптимальний час для жироспалювальних тренувань

# phase.extra.12hours
source: 12 hours: complete glycogen depletion
uk: 12 годин: повне виснаження запасів глікогену

# phase.extra.16hours
source: 16-18 hours: maximum fat burning
uk: 16-18 годин: максимальне жироспалювання

# phase.extra.24hours
source: 24 hours: significant increase in autophagy
uk: 24 години: значне посилення аутофагії

# phase.extra.36hours
source: 36-48 hours: immune system renewal
uk: 36-48 годин: оновлення імунної системи

# disclaimer
source: Disclaimer: This app does not provide medical advice. Please consult a doctor before making any health-related decisions.
uk: Відмова від відповідальності: Цей додаток не надає медичних консультацій. Будь ласка, проконсультуйтеся з лікарем, перш ніж приймати будь-які рішення, пов'язані зі здоров'ям.

# notification.reminder.title
source: ⏰ Reminder
uk: ⏰ Нагадування

# notification.reminder.body
source: Check your fasting phase!
uk: Перевір свою фазу голодування!

# notification.error.scheduling
source: Failed to schedule notification
uk: Помилка додавання нагадування

# notification.scheduled
source: Daily notification scheduled for 12:00 PM
uk: Щоденне нагадування заплановано на 12:00

source: Notification sent
uk: Нагадування надіслано

# notification.cancelled
source: All notifications cancelled.
uk: Усі нагадування скасовано.

# notification.phase.title
source: Phase: %@
uk: Фаза: %@

# sources.title
source: Scientific Sources
uk: Наукові джерела

# sources.disclaimer.title
source: Disclaimer
uk: Відмова від відповідальності

# sources.button.viewStudy
source: View Study
uk: Переглянути дослідження

# sources.source1.title
source: Glycogen and its metabolism: some new developments and old themes
uk: Глікоген та його метаболізм: нові розробки та старі теми

# sources.source2.title
source: Effect of Alternate-Day Fasting on Weight Loss, Weight Maintenance, and Cardioprotection Among Metabolically Healthy Obese Adults: A Randomized Clinical Trial
uk: Вплив чергування днів голодування на втрату ваги, підтримку ваги та кардіопротекцію серед метаболічно здорових дорослих з ожирінням: рандомізоване клінічне дослідження

# sources.source3.title
source: Fasting-induced FGF21 signaling activates hepatic autophagy and lipid degradation via JMJD3 histone demethylase
uk: Сигналізація FGF21, індукована голодуванням, активує гепатичну аутофагію та деградацію ліпідів через JMJD3 гістонову деметилазу

# sources.source4.title
source: Intermittent Fasting and Metabolic Health
uk: Інтервальне голодування та метаболічне здоров'я

# phase.description.show
source: Show Description
uk: Показати опис
